quaxistech/Avalon1126pro/firmware/src/k210_hal.c
/**
 * =============================================================================
 * @file    k210_hal.c
 * @brief   Уровень аппаратной абстракции (HAL) для процессора Kendryte K210
 * =============================================================================
 * 
 * Этот файл содержит функции низкоуровневого доступа к аппаратуре K210:
 * - GPIO
 * - SPI
 * - UART
 * - I2C
 * - Таймеры и PWM
 * - Flash память
 * - Системные функции
 * 
 * K210 - двухъядерный RISC-V процессор с частотой до 800 МГц.
 * Адреса регистров соответствуют документации Kendryte.
 * 
 * @author  Reconstructed from Avalon A1126pro firmware
 * @version 1.0
 * =============================================================================
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>

#include "config.h"
#include "k210_hal.h"

/* =============================================================================
 * РЕГИСТРЫ K210 (адреса в памяти)
 * ============================================================================= */

/* Базовые адреса периферии */
#define SYSCTL_BASE         0x50440000UL    /**< Системный контроллер */
#define FPIOA_BASE          0x502B0000UL    /**< Мультиплексор функций GPIO */
#define GPIO_BASE           0x50200000UL    /**< GPIO контроллер */
#define SPI0_BASE           0x52000000UL    /**< SPI0 контроллер */
#define SPI1_BASE           0x53000000UL    /**< SPI1 контроллер */
#define UART1_BASE          0x50210000UL    /**< UART1 контроллер */
#define UART2_BASE          0x50220000UL    /**< UART2 контроллер */
#define UART3_BASE          0x50230000UL    /**< UART3 контроллер */
#define I2C0_BASE           0x50280000UL    /**< I2C0 контроллер */
#define I2C1_BASE           0x50290000UL    /**< I2C1 контроллер */
#define I2C2_BASE           0x502A0000UL    /**< I2C2 контроллер */
#define TIMER0_BASE         0x502D0000UL    /**< Таймер 0 */
#define TIMER1_BASE         0x502E0000UL    /**< Таймер 1 */
#define TIMER2_BASE         0x502F0000UL    /**< Таймер 2 */
#define WDT0_BASE           0x50400000UL    /**< Watchdog 0 */
#define WDT1_BASE           0x50410000UL    /**< Watchdog 1 */
#define PLIC_BASE           0x0C000000UL    /**< Контроллер прерываний */
#define SPI_FLASH_BASE      0x90000000UL    /**< Память SPI Flash (XIP) */

/* =============================================================================
 * СТРУКТУРЫ РЕГИСТРОВ
 * ============================================================================= */

/**
 * @brief Регистры системного контроллера
 */
typedef struct {
    volatile uint32_t git_id;           /* 0x00: Git ID */
    volatile uint32_t clk_freq;         /* 0x04: Частота */
    volatile uint32_t pll0;             /* 0x08: PLL0 */
    volatile uint32_t pll1;             /* 0x0C: PLL1 */
    volatile uint32_t pll2;             /* 0x10: PLL2 */
    volatile uint32_t reserved1[3];
    volatile uint32_t pll_lock;         /* 0x20: Статус блокировки PLL */
    volatile uint32_t rom_error;        /* 0x24: ROM error */
    volatile uint32_t reserved2[6];
    volatile uint32_t clk_sel0;         /* 0x40: Выбор тактирования 0 */
    volatile uint32_t clk_sel1;         /* 0x44: Выбор тактирования 1 */
    volatile uint32_t clk_en_cent;      /* 0x48: Включение центрального такта */
    volatile uint32_t clk_en_peri;      /* 0x4C: Включение периферии */
    volatile uint32_t soft_reset;       /* 0x50: Программный сброс */
    volatile uint32_t peri_reset;       /* 0x54: Сброс периферии */
    volatile uint32_t clk_th0;          /* 0x58: Делитель 0 */
    volatile uint32_t clk_th1;          /* 0x5C: Делитель 1 */
    volatile uint32_t clk_th2;          /* 0x60: Делитель 2 */
    volatile uint32_t clk_th3;          /* 0x64: Делитель 3 */
    volatile uint32_t clk_th4;          /* 0x68: Делитель 4 */
    volatile uint32_t clk_th5;          /* 0x6C: Делитель 5 */
    volatile uint32_t clk_th6;          /* 0x70: Делитель 6 */
    volatile uint32_t misc;             /* 0x74: Разное */
    volatile uint32_t peri;             /* 0x78: Периферия */
    volatile uint32_t spi_sleep;        /* 0x7C: SPI sleep */
    volatile uint32_t reset_status;     /* 0x80: Статус сброса */
    volatile uint32_t dma_sel0;         /* 0x84: Выбор DMA 0 */
    volatile uint32_t dma_sel1;         /* 0x88: Выбор DMA 1 */
    volatile uint32_t power_sel;        /* 0x8C: Выбор питания */
} sysctl_regs_t;

/**
 * @brief Регистры GPIO
 */
typedef struct {
    volatile uint32_t data_out;         /* 0x00: Выходные данные */
    volatile uint32_t direction;        /* 0x04: Направление (1=выход) */
    volatile uint32_t source;           /* 0x08: Источник данных */
    volatile uint32_t reserved1[9];
    volatile uint32_t int_enable;       /* 0x30: Разрешение прерываний */
    volatile uint32_t int_mask;         /* 0x34: Маска прерываний */
    volatile uint32_t int_level;        /* 0x38: Тип прерывания (уровень/фронт) */
    volatile uint32_t int_polarity;     /* 0x3C: Полярность прерывания */
    volatile uint32_t int_status;       /* 0x40: Статус прерываний */
    volatile uint32_t int_raw_status;   /* 0x44: Сырой статус */
    volatile uint32_t int_debounce;     /* 0x48: Дебаунс */
    volatile uint32_t int_clear;        /* 0x4C: Очистка прерываний */
    volatile uint32_t data_in;          /* 0x50: Входные данные */
    volatile uint32_t reserved2[3];
    volatile uint32_t sync_level;       /* 0x60: Синхронизация уровня */
    volatile uint32_t id_code;          /* 0x64: ID код */
    volatile uint32_t int_both_edge;    /* 0x68: Прерывание по обоим фронтам */
} gpio_regs_t;

/**
 * @brief Регистры SPI
 */
typedef struct {
    volatile uint32_t ctrl0;            /* 0x00: Контроль 0 */
    volatile uint32_t ctrl1;            /* 0x04: Контроль 1 */
    volatile uint32_t ssienr;           /* 0x08: Включение SSI */
    volatile uint32_t mwcr;             /* 0x0C: Microwire control */
    volatile uint32_t ser;              /* 0x10: Выбор ведомого */
    volatile uint32_t baudr;            /* 0x14: Скорость передачи */
    volatile uint32_t txftlr;           /* 0x18: Порог TX FIFO */
    volatile uint32_t rxftlr;           /* 0x1C: Порог RX FIFO */
    volatile uint32_t txflr;            /* 0x20: Уровень TX FIFO */
    volatile uint32_t rxflr;            /* 0x24: Уровень RX FIFO */
    volatile uint32_t sr;               /* 0x28: Статус */
    volatile uint32_t imr;              /* 0x2C: Маска прерываний */
    volatile uint32_t isr;              /* 0x30: Статус прерываний */
    volatile uint32_t risr;             /* 0x34: Сырой статус прерываний */
    volatile uint32_t txoicr;           /* 0x38: TX overflow clear */
    volatile uint32_t rxoicr;           /* 0x3C: RX overflow clear */
    volatile uint32_t rxuicr;           /* 0x40: RX underflow clear */
    volatile uint32_t msticr;           /* 0x44: Multi-master clear */
    volatile uint32_t icr;              /* 0x48: Общий clear */
    volatile uint32_t dmacr;            /* 0x4C: DMA контроль */
    volatile uint32_t dmatdlr;          /* 0x50: DMA TX уровень */
    volatile uint32_t dmardlr;          /* 0x54: DMA RX уровень */
    volatile uint32_t idr;              /* 0x58: Идентификатор */
    volatile uint32_t version;          /* 0x5C: Версия */
    volatile uint32_t dr[36];           /* 0x60: Data register */
    volatile uint32_t rx_sample_dly;    /* 0xF0: Задержка семплирования */
    volatile uint32_t spi_ctrl0;        /* 0xF4: SPI контроль */
    volatile uint32_t reserved1;
    volatile uint32_t xip_mode_bits;    /* 0xFC: XIP mode bits */
    volatile uint32_t xip_incr_inst;    /* 0x100: XIP instruction */
    volatile uint32_t xip_wrap_inst;    /* 0x104: XIP wrap instruction */
    volatile uint32_t xip_ctrl;         /* 0x108: XIP контроль */
    volatile uint32_t xip_ser;          /* 0x10C: XIP slave enable */
    volatile uint32_t xrxoicr;          /* 0x110: XIP RX overflow clear */
    volatile uint32_t xip_cnt_timeout;  /* 0x114: XIP timeout */
    volatile uint32_t endian;           /* 0x118: Порядок байт */
} spi_regs_t;

/**
 * @brief Регистры UART
 */
typedef struct {
    union {
        volatile uint32_t rbr;          /* 0x00: Receive buffer (LCR[7]=0) */
        volatile uint32_t thr;          /* 0x00: Transmit holding (LCR[7]=0) */
        volatile uint32_t dll;          /* 0x00: Divisor latch low (LCR[7]=1) */
    };
    union {
        volatile uint32_t dlh;          /* 0x04: Divisor latch high (LCR[7]=1) */
        volatile uint32_t ier;          /* 0x04: Interrupt enable (LCR[7]=0) */
    };
    union {
        volatile uint32_t fcr;          /* 0x08: FIFO control (write) */
        volatile uint32_t iir;          /* 0x08: Interrupt identify (read) */
    };
    volatile uint32_t lcr;              /* 0x0C: Line control */
    volatile uint32_t mcr;              /* 0x10: Modem control */
    volatile uint32_t lsr;              /* 0x14: Line status */
    volatile uint32_t msr;              /* 0x18: Modem status */
    volatile uint32_t scr;              /* 0x1C: Scratch */
    volatile uint32_t reserved1[4];
    volatile uint32_t srbr_sthr[16];    /* 0x30: Shadow RBR/THR */
    volatile uint32_t far;              /* 0x70: FIFO access */
    volatile uint32_t tfr;              /* 0x74: TX FIFO read */
    volatile uint32_t rfw;              /* 0x78: RX FIFO write */
    volatile uint32_t usr;              /* 0x7C: UART status */
    volatile uint32_t tfl;              /* 0x80: TX FIFO level */
    volatile uint32_t rfl;              /* 0x84: RX FIFO level */
    volatile uint32_t srr;              /* 0x88: Software reset */
    volatile uint32_t srts;             /* 0x8C: Shadow RTS */
    volatile uint32_t sbcr;             /* 0x90: Shadow break control */
    volatile uint32_t sdmam;            /* 0x94: Shadow DMA mode */
    volatile uint32_t sfe;              /* 0x98: Shadow FIFO enable */
    volatile uint32_t srt;              /* 0x9C: Shadow RX trigger */
    volatile uint32_t stet;             /* 0xA0: Shadow TX trigger */
    volatile uint32_t htx;              /* 0xA4: Halt TX */
    volatile uint32_t dmasa;            /* 0xA8: DMA software ack */
    volatile uint32_t tcr;              /* 0xAC: Transceiver control */
    volatile uint32_t de_en;            /* 0xB0: DE enable */
    volatile uint32_t re_en;            /* 0xB4: RE enable */
    volatile uint32_t det;              /* 0xB8: DE timing */
    volatile uint32_t tat;              /* 0xBC: Turn-around timing */
    volatile uint32_t dlf;              /* 0xC0: Divisor latch fraction */
    volatile uint32_t rar;              /* 0xC4: Receive address */
    volatile uint32_t tar;              /* 0xC8: Transmit address */
    volatile uint32_t lcr_ext;          /* 0xCC: Line control extended */
} uart_regs_t;

/**
 * @brief Регистры таймера
 */
typedef struct {
    volatile uint32_t load;             /* 0x00: Начальное значение */
    volatile uint32_t value;            /* 0x04: Текущее значение */
    volatile uint32_t ctrl;             /* 0x08: Контроль */
    volatile uint32_t eoi;              /* 0x0C: End of interrupt */
    volatile uint32_t intr_stat;        /* 0x10: Статус прерывания */
} timer_channel_regs_t;

