quaxistech/Avalon1126pro/firmware/src/k210_hal.c
/* =============================================================================
 * ГЛОБАЛЬНЫЕ УКАЗАТЕЛИ НА РЕГИСТРЫ
 * ============================================================================= */

static volatile sysctl_regs_t * const sysctl = (sysctl_regs_t *)SYSCTL_BASE;
static volatile gpio_regs_t * const gpio = (gpio_regs_t *)GPIO_BASE;
static volatile spi_regs_t * const spi0 = (spi_regs_t *)SPI0_BASE;
static volatile spi_regs_t * const spi1 = (spi_regs_t *)SPI1_BASE;
static volatile uart_regs_t * const uart1 = (uart_regs_t *)UART1_BASE;
static volatile timer_channel_regs_t * const timer0 = (timer_channel_regs_t *)TIMER0_BASE;

/* =============================================================================
 * СИСТЕМНЫЕ ФУНКЦИИ
 * ============================================================================= */

/**
 * @brief Инициализация системного контроллера
 */
void sysctl_init(void)
{
    /* Включаем все необходимые тактовые сигналы */
    sysctl->clk_en_cent = 0xFFFFFFFF;
    sysctl->clk_en_peri = 0xFFFFFFFF;
}

/**
 * @brief Установка частоты PLL
 * 
 * @param pll Номер PLL (0, 1 или 2)
 * @param freq Целевая частота в Гц
 * @return 0 при успехе
 */
int sysctl_pll_set_freq(int pll, uint32_t freq)
{
    /* Упрощённая реализация - в реальности нужен расчёт делителей */
    volatile uint32_t *pll_reg;
    
    switch (pll) {
        case 0: pll_reg = &sysctl->pll0; break;
        case 1: pll_reg = &sysctl->pll1; break;
        case 2: pll_reg = &sysctl->pll2; break;
        default: return -1;
    }
    
    /* Конфигурация PLL (упрощённо) */
    /* В реальной реализации нужно рассчитать CLKR, CLKF, CLKOD */
    
    /* Ждём блокировки PLL */
    while ((sysctl->pll_lock & (1 << pll)) == 0) {
        /* Ждём */
    }
    
    return 0;
}

/**
 * @brief Установка частоты CPU
 * 
 * @param freq Частота в Гц
 * @return 0 при успехе
 */
int sysctl_cpu_set_freq(uint32_t freq)
{
    /* Выбираем источник тактирования для CPU */
    /* CPU использует PLL0 */
    sysctl->clk_sel0 = 0x01;  /* Выбор PLL0 для CPU */
    
    return 0;
}

/**
 * @brief Включение тактирования периферии
 * 
 * @param periph Номер периферийного устройства
 */
void sysctl_clock_enable(int periph)
{
    sysctl->clk_en_peri |= (1 << periph);
}

/**
 * @brief Программный сброс системы
 */
void sysctl_reset(void)
{
    sysctl->soft_reset = 0x01;
    
    /* Никогда не должны сюда вернуться */
    while (1) { }
}

/**
 * @brief Планирование перезагрузки
 * 
 * @param delay_ms Задержка перед перезагрузкой в мс
 */
void schedule_reboot(int delay_ms)
{
    /* Запускаем таймер для отложенной перезагрузки */
    vTaskDelay(pdMS_TO_TICKS(delay_ms));
    sysctl_reset();
}

/* =============================================================================
 * GPIO ФУНКЦИИ
 * ============================================================================= */

/**
 * @brief Инициализация GPIO
 */
void gpio_init(void)
{
    /* Сброс состояния GPIO */
    gpio->data_out = 0;
    gpio->direction = 0;
    gpio->int_enable = 0;
}

/**
 * @brief Установка режима GPIO пина
 * 
 * @param pin Номер пина
 * @param mode Режим (GPIO_DM_INPUT или GPIO_DM_OUTPUT)
 */
void gpio_set_drive_mode(int pin, int mode)
{
    if (pin < 0 || pin >= 32) return;
    
    if (mode == GPIO_DM_OUTPUT) {
        gpio->direction |= (1 << pin);
    } else {
        gpio->direction &= ~(1 << pin);
    }
}

/**
 * @brief Установка значения GPIO пина
 * 
 * @param pin Номер пина
 * @param value GPIO_PV_LOW или GPIO_PV_HIGH
 */
void gpio_set_pin(int pin, int value)
{
    if (pin < 0 || pin >= 32) return;
    
    if (value) {
        gpio->data_out |= (1 << pin);
    } else {
        gpio->data_out &= ~(1 << pin);
    }
}

/**
 * @brief Чтение значения GPIO пина
 * 
 * @param pin Номер пина
 * @return GPIO_PV_LOW или GPIO_PV_HIGH
 */
int gpio_get_pin(int pin)
{
    if (pin < 0 || pin >= 32) return 0;
    
    return (gpio->data_in & (1 << pin)) ? GPIO_PV_HIGH : GPIO_PV_LOW;
}

/**
 * @brief Управление светодиодом
 * 
 * @param pin Номер пина светодиода
 * @param on true для включения
 */
void led_set(int pin, bool on)
{
    gpio_set_pin(pin, on ? GPIO_PV_HIGH : GPIO_PV_LOW);
}

/**
 * @brief Установка статуса светодиода
 * 
 * @param status Код статуса
 */
void led_set_status(int status)
{
    switch (status) {
        case LED_STATUS_OFF:
            led_set(PIN_LED_STATUS, false);
            led_set(PIN_LED_ERROR, false);
            break;
        case LED_STATUS_READY:
            led_set(PIN_LED_STATUS, true);
            led_set(PIN_LED_ERROR, false);
            break;
        case LED_STATUS_ERROR:
            led_set(PIN_LED_STATUS, false);
            led_set(PIN_LED_ERROR, true);
            break;
    }
}

/**
 * @brief Мигание красным светодиодом (индикация ошибки)
 */
void led_error_blink(void)
{
    for (int i = 0; i < 5; i++) {
        led_set(PIN_LED_ERROR, true);
        delay_ms(200);
        led_set(PIN_LED_ERROR, false);
        delay_ms(200);
    }
}

/* =============================================================================
 * FPIOA ФУНКЦИИ (мультиплексор GPIO)
 * ============================================================================= */

/**
 * @brief Настройка функции пина FPIOA
 * 
 * @param pin Номер физического пина
 * @param func Функция пина
 */
void fpioa_set_function(int pin, int func)
{
    volatile uint32_t *fpioa = (uint32_t *)FPIOA_BASE;
    
    if (pin < 0 || pin >= 48) return;
    
    fpioa[pin] = func;
}

/* =============================================================================
 * SPI ФУНКЦИИ
 * ============================================================================= */

/**
 * @brief Инициализация SPI
 * 
 * @param spi_num Номер SPI (0 или 1)
 * @param mode Режим SPI (0-3)
 * @param frame_format Формат кадра
 * @param data_bits Количество бит данных
 * @param endian Порядок байт
 */
void spi_init(int spi_num, int mode, int frame_format, int data_bits, int endian)
{
    volatile spi_regs_t *spi;
    
    if (spi_num == 0) {
        spi = spi0;
    } else if (spi_num == 1) {
        spi = spi1;
    } else {
        return;
    }
    
    /* Отключаем SPI */
    spi->ssienr = 0;
    
    /* Настройка режима */
    uint32_t ctrl0 = 0;
    ctrl0 |= (data_bits - 1) << 0;    /* DFS - Data frame size */
    ctrl0 |= frame_format << 4;       /* FRF - Frame format */
    ctrl0 |= (mode & 0x01) << 6;      /* SCPH - Clock phase */
    ctrl0 |= ((mode >> 1) & 0x01) << 7; /* SCPOL - Clock polarity */
    ctrl0 |= 0 << 8;                  /* TMOD - Transfer mode (TX & RX) */
    
    spi->ctrl0 = ctrl0;
    
    /* Настройка порогов FIFO */
    spi->txftlr = 0;
    spi->rxftlr = 0;
    
    /* Включаем SPI */
    spi->ssienr = 1;
}

/**
 * @brief Установка скорости SPI
 * 
 * @param spi_num Номер SPI
 * @param baudrate Скорость в Гц
 */
void spi_set_clk_rate(int spi_num, uint32_t baudrate)
{
    volatile spi_regs_t *spi;
    
    if (spi_num == 0) {
        spi = spi0;
    } else if (spi_num == 1) {
        spi = spi1;
    } else {
        return;
    }
    
    /* Рассчитываем делитель */
    /* Baudrate = SCLK / BAUDR, где BAUDR - чётное число от 2 до 65534 */
    uint32_t spi_clk = K210_CPU_FREQ / 2;  /* Частота SPI тактирования */
    uint32_t div = spi_clk / baudrate;
    
    if (div < 2) div = 2;
    if (div > 65534) div = 65534;
    if (div & 1) div++;  /* Должен быть чётным */
    
