quaxistech/Avalon1126pro/firmware/src/k210_hal.c
    spi->ssienr = 0;     /* Выключаем */
    spi->baudr = div;
    spi->ssienr = 1;     /* Включаем */
}

/**
 * @brief Отправка и приём данных по SPI
 * 
 * @param spi_num Номер SPI
 * @param tx_data Данные для отправки
 * @param rx_data Буфер для приёма (может быть NULL)
 * @param len Длина данных в байтах
 * @return 0 при успехе
 */
int spi_send_receive(int spi_num, const uint8_t *tx_data, uint8_t *rx_data, int len)
{
    volatile spi_regs_t *spi;
    
    if (spi_num == 0) {
        spi = spi0;
    } else if (spi_num == 1) {
        spi = spi1;
    } else {
        return -1;
    }
    
    int tx_idx = 0;
    int rx_idx = 0;
    
    while (tx_idx < len || rx_idx < len) {
        /* Записываем в TX FIFO */
        while (tx_idx < len && (spi->sr & 0x02)) {  /* TNF - TX FIFO not full */
            spi->dr[0] = tx_data ? tx_data[tx_idx] : 0xFF;
            tx_idx++;
        }
        
        /* Читаем из RX FIFO */
        while (rx_idx < len && (spi->sr & 0x08)) {  /* RNE - RX FIFO not empty */
            uint8_t data = spi->dr[0];
            if (rx_data) {
                rx_data[rx_idx] = data;
            }
            rx_idx++;
        }
    }
    
    /* Ждём завершения передачи */
    while (spi->sr & 0x01) {  /* Busy */
        /* Ждём */
    }
    
    return 0;
}

/* =============================================================================
 * UART ФУНКЦИИ
 * ============================================================================= */

/**
 * @brief Инициализация UART
 * 
 * @param uart_num Номер UART
 */
void uart_init(int uart_num)
{
    /* Конфигурация по умолчанию в uart_configure */
}

/**
 * @brief Настройка UART
 * 
 * @param uart_num Номер UART
 * @param baudrate Скорость передачи
 * @param data_bits Биты данных
 * @param stop_bits Стоп-биты
 * @param parity Чётность
 */
void uart_configure(int uart_num, uint32_t baudrate, int data_bits, int stop_bits, int parity)
{
    volatile uart_regs_t *uart = uart1;  /* Используем UART1 */
    
    /* Рассчитываем делитель */
    uint32_t uart_clk = K210_CPU_FREQ / 2;
    uint32_t divisor = uart_clk / (16 * baudrate);
    
    /* Включаем доступ к DLL/DLH */
    uart->lcr = 0x80;  /* DLAB = 1 */
    
    /* Устанавливаем делитель */
    uart->dll = divisor & 0xFF;
    uart->dlh = (divisor >> 8) & 0xFF;
    
    /* Настраиваем формат: 8N1 */
    uint32_t lcr = 0;
    lcr |= (data_bits - 5) & 0x03;  /* WLS - Word length */
    if (stop_bits == UART_STOP_2) {
        lcr |= 0x04;  /* STB - Stop bits */
    }
    if (parity != UART_PARITY_NONE) {
        lcr |= 0x08;  /* PEN - Parity enable */
        if (parity == UART_PARITY_EVEN) {
            lcr |= 0x10;  /* EPS - Even parity */
        }
    }
    
    uart->lcr = lcr;  /* DLAB = 0 */
    
    /* Включаем FIFO */
    uart->fcr = 0x07;  /* Enable FIFO, clear TX/RX FIFO */
}

/**
 * @brief Отправка байта по UART
 * 
 * @param uart_num Номер UART
 * @param ch Байт для отправки
 */
void uart_send(int uart_num, uint8_t ch)
{
    volatile uart_regs_t *uart = uart1;
    
    /* Ждём пока TX FIFO не освободится */
    while ((uart->lsr & 0x20) == 0) {
        /* Ждём */
    }
    
    uart->thr = ch;
}

/**
 * @brief Приём байта по UART
 * 
 * @param uart_num Номер UART
 * @return Принятый байт или -1 если данных нет
 */
int uart_recv(int uart_num)
{
    volatile uart_regs_t *uart = uart1;
    
    /* Проверяем есть ли данные */
    if ((uart->lsr & 0x01) == 0) {
        return -1;
    }
    
    return uart->rbr;
}

/* =============================================================================
 * I2C ФУНКЦИИ
 * ============================================================================= */

/**
 * @brief Инициализация I2C
 * 
 * @param i2c_num Номер I2C
 * @param slave_addr Адрес ведомого
 * @param addr_width Ширина адреса (7 или 10 бит)
 * @param clk_rate Скорость I2C
 */
void i2c_init(int i2c_num, uint8_t slave_addr, int addr_width, uint32_t clk_rate)
{
    /* Упрощённая реализация I2C */
    /* В реальной прошивке нужна полноценная инициализация */
}

/* =============================================================================
 * ТАЙМЕР И PWM ФУНКЦИИ
 * ============================================================================= */

/**
 * @brief Инициализация таймера
 * 
 * @param timer_num Номер таймера
 */
void timer_init(int timer_num)
{
    timer0->ctrl = 0;  /* Выключен */
}

/**
 * @brief Установка интервала таймера
 * 
 * @param timer_num Номер таймера
 * @param channel Канал таймера
 * @param interval_ns Интервал в наносекундах
 */
void timer_set_interval(int timer_num, int channel, uint32_t interval_ns)
{
    /* Рассчитываем значение счётчика */
    uint32_t timer_clk = K210_CPU_FREQ / 2;  /* Частота таймера */
    uint32_t count = (uint64_t)timer_clk * interval_ns / 1000000000ULL;
    
    timer0->load = count;
}

/**
 * @brief Включение/выключение таймера
 * 
 * @param timer_num Номер таймера
 * @param channel Канал
 * @param enable 1 для включения
 */
void timer_set_enable(int timer_num, int channel, int enable)
{
    if (enable) {
        timer0->ctrl = 0x01;  /* Enable */
    } else {
        timer0->ctrl = 0x00;  /* Disable */
    }
}

/**
 * @brief Установка частоты ШИМ
 * 
 * @param pwm_num Номер ШИМ
 * @param channel Канал
 * @param freq Частота в Гц
 * @param duty Скважность (0.0 - 1.0)
 */
void pwm_set_frequency(int pwm_num, int channel, uint32_t freq, double duty)
{
    /* Используем таймер для генерации ШИМ */
    uint32_t timer_clk = K210_CPU_FREQ / 2;
    uint32_t period = timer_clk / freq;
    uint32_t pulse = (uint32_t)(period * duty);
    
    timer0->load = period;
    timer0->ctrl = 0x03;  /* Enable + Auto-reload */
}

/* =============================================================================
 * FLASH ФУНКЦИИ
 * ============================================================================= */

/**
 * @brief Чтение данных из Flash
 * 
 * @param addr Адрес во Flash
 * @param data Буфер для данных
 * @param len Длина данных
 * @return 0 при успехе
 */
int flash_read(uint32_t addr, uint8_t *data, int len)
{
    /* При XIP режиме Flash отображается в адресное пространство */
    const uint8_t *flash = (const uint8_t *)(SPI_FLASH_BASE + addr);
    
    memcpy(data, flash, len);
    
