quaxistech/Avalon1126pro/firmware/src/k210_hal.c
    return 0;
}

/**
 * @brief Запись данных во Flash
 * 
 * @param addr Адрес во Flash
 * @param data Данные для записи
 * @param len Длина данных
 * @return 0 при успехе
 */
int flash_write(uint32_t addr, const uint8_t *data, int len)
{
    /* Упрощённая реализация */
    /* В реальности нужно использовать команды SPI Flash */
    
    /* Flash можно записывать только после стирания */
    /* И только по страницам (256 байт) */
    
    return 0;  /* TODO: Полная реализация */
}

/**
 * @brief Стирание сектора Flash
 * 
 * @param addr Адрес сектора
 * @return 0 при успехе
 */
int flash_erase_sector(uint32_t addr)
{
    /* Упрощённая реализация */
    /* Сектор обычно 4KB */
    
    return 0;  /* TODO: Полная реализация */
}

/* =============================================================================
 * WATCHDOG ФУНКЦИИ
 * ============================================================================= */

/**
 * @brief Инициализация Watchdog
 * 
 * @param wdt_num Номер WDT
 * @param timeout_ms Таймаут в миллисекундах
 * @param callback Функция обратного вызова (может быть NULL)
 */
void wdt_init(int wdt_num, uint32_t timeout_ms, void (*callback)(void))
{
    volatile uint32_t *wdt = (uint32_t *)WDT0_BASE;
    
    /* Рассчитываем значение таймера */
    uint32_t wdt_clk = K210_CPU_FREQ / 2;
    uint32_t count = (uint64_t)wdt_clk * timeout_ms / 1000;
    
    /* Устанавливаем таймаут */
    wdt[0] = count;  /* TORR - Timeout range */
    wdt[2] = 0x00;   /* CR - Control (пока выключен) */
}

/**
 * @brief Запуск Watchdog
 * 
 * @param wdt_num Номер WDT
 */
void wdt_start(int wdt_num)
{
    volatile uint32_t *wdt = (uint32_t *)WDT0_BASE;
    
    wdt[2] = 0x01;  /* CR - Enable */
}

/**
 * @brief Сброс (кормление) Watchdog
 * 
 * @param wdt_num Номер WDT
 */
void wdt_feed(int wdt_num)
{
    volatile uint32_t *wdt = (uint32_t *)WDT0_BASE;
    
    wdt[3] = 0x76;  /* CRR - Counter restart (magic value) */
}

/* =============================================================================
 * PLIC (контроллер прерываний)
 * ============================================================================= */

/**
 * @brief Инициализация контроллера прерываний
 */
void plic_init(void)
{
    volatile uint32_t *plic = (uint32_t *)PLIC_BASE;
    
    /* Установка порогов приоритета */
    plic[0x200000/4] = 0;  /* Threshold для hart 0 */
}

/* =============================================================================
 * УТИЛИТЫ ВРЕМЕНИ
 * ============================================================================= */

/** Счётчик миллисекунд (обновляется из SysTick) */
static volatile uint32_t tick_count = 0;

/**
 * @brief Получение времени в миллисекундах
 * 
 * @return Время в мс с момента запуска
 */
uint32_t get_ms_time(void)
{
    return xTaskGetTickCount() * portTICK_PERIOD_MS;
}

/**
 * @brief Задержка в миллисекундах
 * 
 * @param ms Задержка в мс
 */
void delay_ms(uint32_t ms)
{
    vTaskDelay(pdMS_TO_TICKS(ms));
}

/**
 * @brief Задержка в микросекундах
 * 
 * @param us Задержка в мкс
 */
void delay_us(uint32_t us)
{
    /* Busy-loop для коротких задержек */
    volatile uint32_t cycles = us * (K210_CPU_FREQ / 1000000) / 5;
    while (cycles--) {
        __asm__ volatile("nop");
    }
}

/* =============================================================================
 * ЛОГИРОВАНИЕ
 * ============================================================================= */

/**
 * @brief Функция логирования (аналог CGMiner applog)
 * 
 * @param level Уровень логирования
 * @param fmt Формат строки
 * @param ... Аргументы
 */
void applog(int level, const char *fmt, ...)
{
    static const char *level_str[] = {
        "[ERR]", "[WARN]", "[INFO]", "[DEBUG]"
    };
    
    if (level < 0 || level > LOG_DEBUG) {
        level = LOG_INFO;
    }
    
    /* Выводим метку уровня */
    printf("%s ", level_str[level]);
    
    /* Выводим сообщение */
    va_list args;
    va_start(args, fmt);
    vprintf(fmt, args);
    va_end(args);
    
    printf("\r\n");
}

/* =============================================================================
 * ПРЕРЫВАНИЯ
 * ============================================================================= */

/**
 * @brief Отключение прерываний
 */
void __disable_irq(void)
{
    __asm__ volatile("csrc mstatus, 8");  /* Очистка MIE в mstatus */
}

/**
 * @brief Включение прерываний
 */
void __enable_irq(void)
{
    __asm__ volatile("csrs mstatus, 8");  /* Установка MIE в mstatus */
}
